ack
autoconf
cask
colordiff
cscope
ctags
docker-machine
editorconfig
emacs
exercism
fzf
gdbm
heroku
htop
icu4c
jq
kafka
libevent
libyaml
mongodb
node-build
nodenv
oniguruma
openssl
openssl@1.1
pcre
perl
pkg-config
python
readline
reattach-to-user-namespace
redis
ruby
sqlite
the_silver_searcher
tmux
vim
wget
xz
zookeeper
