tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "tankerhq/repo"
tap "universal-ctags/universal-ctags"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# More intuitive version of du in rust
brew "dust"
# General purpose Language Server
brew "efm-langserver"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Emoji on the command-line :scream:
brew "emojify"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Command-line fuzzy finder written in Go
brew "fzf"
# Test automation tool that supports executable documentation
brew "gauge"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# HTTP/2 C Library
brew "nghttp2"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Powerful, lightweight programming language
brew "lua"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# C library implementing the SSH2 protocol
brew "libssh2"
# Package manager for the Lua programming language
brew "luarocks"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Small build system for use with gyp or CMake
brew "ninja"
# Modern shell for the GitHub era
brew "nushell"
# Paste PNG into files
brew "pngpaste"
# Modern replacement for ps written by Rust
brew "procs"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Util like xargs + awk with pattern matching support
brew "rargs"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp", "with-nobu417-big-sur-icon", "with-xwidgets"]
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Find and replace text in source files
brew "tankerhq/repo/ruplacer"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"], link: false
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Music streaming service
cask "spotify"
