tap "d12frosted/emacs-plus"
tap "elastic/tap"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "nodenv/nodenv"
tap "ouchxp/nodenv"
tap "rockymadden/rockymadden"
tap "sargsyan/github-notifier"
tap "schniz/tap"
tap "tankerhq/repo"
tap "universal-ctags/universal-ctags"
cask "adoptopenjdk8"
# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", link: false
# Emoji on the command-line :scream:
brew "emojify"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Test automation tool that supports executable documentation
brew "gauge"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Command-driven, interactive function plotting
brew "gnuplot"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Modern replacement for ps written by Rust
brew "procs"
# File browser
brew "ranger"
# Util like xargs + awk with pattern matching support
brew "rargs"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["HEAD", "with-dbus", "with-debug", "with-jansson", "with-modern-sexy-v1-icon", "with-no-titlebar", "with-xwidgets"]
# File harvester to ship log files to Elasticsearch or Logstash
brew "elastic/tap/filebeat-full"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Pick a node version from .nvmrc
brew "ouchxp/nodenv/nodenv-nvmrc"
brew "rockymadden/rockymadden/slack-cli"
# Get Github and Github Enterprise notifications in your Mac OS 
brew "sargsyan/github-notifier/github-notifier"
# Find and replace text in source files
brew "tankerhq/repo/ruplacer"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alacritty"
cask "amethyst"
cask "bloomrpc"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "iterm2"
cask "java"
cask "kitty"
