ack
autoconf
automake
bash
cairo
cask
cmake
colordiff
coreutils
cscope
ctags
docker-machine
editorconfig
emacs
emacs-plus
exercism
fd
fontconfig
freetype
fribidi
fzf
gdbm
gdk-pixbuf
gettext
glib
gmp
gnu-sed
gnutls
gobject-introspection
gradle
graphite2
harfbuzz
heroku
heroku-node
htop
httpie
icu4c
imagemagick@6
jpeg
jq
kafka
libcroco
libevent
libffi
libidn2
libpng
librsvg
libtasn1
libtiff
libtool
libunistring
libyaml
little-cms2
mongodb
nasm
nettle
node
node-build
nodenv
nodenv-npm-migrate
nodenv-nvmrc
oniguruma
openssl
openssl@1.1
p11-kit
pango
pcre
perl
pipes-sh
pixman
pkg-config
python
python3
python@2
ranger
readline
reattach-to-user-namespace
redis
ruby
sbt
scala
screen
slack-cli
sphinx-doc
sqlite
the_silver_searcher
tmux
tree
universal-ctags
vim
watch
wget
xz
yarn
yasm
zookeeper
zsh-syntax-highlighting
