tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "nodenv/nodenv"
tap "ouchxp/nodenv"
tap "rockymadden/rockymadden"
tap "universal-ctags/universal-ctags"
cask "java"
brew "ack"
brew "bats-core"
brew "emacs"
brew "cask"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "ctags", link: false
brew "docker-machine", link: false
brew "editorconfig"
brew "exercism"
brew "fd"
brew "sqlite"
brew "fontforge"
brew "fzf"
brew "gnu-sed"
brew "gradle"
brew "htop"
brew "httpie"
brew "jq"
brew "kafka"
brew "mongodb"
brew "nasm"
brew "node-build"
brew "nodenv"
brew "pipes-sh"
brew "ranger"
brew "reattach-to-user-namespace"
brew "redis"
brew "sbt"
brew "scala"
brew "screen"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yasm"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus", link: false
brew "heroku/brew/heroku"
brew "nodenv/nodenv/nodenv-npm-migrate"
brew "nodenv/nodenv/nodenv-package-json-engine"
brew "ouchxp/nodenv/nodenv-nvmrc"
brew "rockymadden/rockymadden/slack-cli"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
